Tekla Open API Reference for Tekla Structures 2025
Distance Constructor (Double, Distance.UnitType)
 Initializes a new instance of the structure.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Distance(
	double distance,
	Distance.UnitType unitType
)
Public Sub New (
	distance As Double,
	unitType As Distance.UnitType
)
Parameters
distance
Type: System.Double
The distance in the specified units.
unitType
Type: Tekla.Structures.Datatype.Distance.UnitType
The distance unit type.
Exceptions
Exception | Condition
ArgumentException | Thrown if an invalid unit type is specified.
Examples
 This example shows how to construct a new Distance instance with a specific unit type.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance distance = new Distance(2, Distance.UnitType.Inch);
       }
}
See Also
Reference
Distance Structure
Distance Overload
Tekla.Structures.Datatype Namespace